ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/TIM/hal_pwm_lld.c
#if GD32_PWM_USE_TIM3
  /* Driver initialization.*/
  pwmObjectInit(&PWMD3);
  PWMD3.channels = GD32_TIM3_CHANNELS;
  PWMD3.tim = GD32_TIM3;
#endif

#if GD32_PWM_USE_TIM4
  /* Driver initialization.*/
  pwmObjectInit(&PWMD4);
  PWMD4.channels = GD32_TIM4_CHANNELS;
  PWMD4.tim = GD32_TIM4;
#endif

#if GD32_PWM_USE_TIM5
  /* Driver initialization.*/
  pwmObjectInit(&PWMD5);
  PWMD5.channels = GD32_TIM5_CHANNELS;
  PWMD5.tim = GD32_TIM5;
#endif

#if GD32_PWM_USE_TIM8
  /* Driver initialization.*/
  pwmObjectInit(&PWMD8);
  PWMD8.channels = GD32_TIM8_CHANNELS;
  PWMD8.tim = GD32_TIM8;
#endif

#if GD32_PWM_USE_TIM9
  /* Driver initialization.*/
  pwmObjectInit(&PWMD9);
  PWMD9.channels = GD32_TIM9_CHANNELS;
  PWMD9.tim = GD32_TIM9;
#endif

#if GD32_PWM_USE_TIM10
  /* Driver initialization.*/
  pwmObjectInit(&PWMD10);
  PWMD10.channels = GD32_TIM10_CHANNELS;
  PWMD10.tim = GD32_TIM10;
#endif

#if GD32_PWM_USE_TIM11
  /* Driver initialization.*/
  pwmObjectInit(&PWMD11);
  PWMD11.channels = GD32_TIM11_CHANNELS;
  PWMD11.tim = GD32_TIM11;
#endif

#if GD32_PWM_USE_TIM12
  /* Driver initialization.*/
  pwmObjectInit(&PWMD12);
  PWMD12.channels = GD32_TIM12_CHANNELS;
  PWMD12.tim = GD32_TIM12;
#endif

#if GD32_PWM_USE_TIM13
  /* Driver initialization.*/
  pwmObjectInit(&PWMD13);
  PWMD13.channels = GD32_TIM13_CHANNELS;
  PWMD13.tim = GD32_TIM13;
#endif

#if GD32_PWM_USE_TIM14
  /* Driver initialization.*/
  pwmObjectInit(&PWMD14);
  PWMD14.channels = GD32_TIM14_CHANNELS;
  PWMD14.tim = GD32_TIM14;
#endif

#if GD32_PWM_USE_TIM15
  /* Driver initialization.*/
  pwmObjectInit(&PWMD15);
  PWMD15.channels = GD32_TIM15_CHANNELS;
  PWMD15.tim = GD32_TIM15;
#endif

#if GD32_PWM_USE_TIM16
  /* Driver initialization.*/
  pwmObjectInit(&PWMD16);
  PWMD16.channels = GD32_TIM16_CHANNELS;
  PWMD16.tim = GD32_TIM16;
#endif

#if GD32_PWM_USE_TIM17
  /* Driver initialization.*/
  pwmObjectInit(&PWMD17);
  PWMD17.channels = GD32_TIM17_CHANNELS;
  PWMD17.tim = GD32_TIM17;
#endif

#if GD32_PWM_USE_TIM20
  /* Driver initialization.*/
  pwmObjectInit(&PWMD20);
  PWMD20.channels = GD32_TIM20_CHANNELS;
  PWMD20.tim = GD32_TIM20;
#endif

#if GD32_PWM_USE_TIM21
  /* Driver initialization.*/
  pwmObjectInit(&PWMD21);
  PWMD21.channels = GD32_TIM21_CHANNELS;
  PWMD21.tim = GD32_TIM21;
#endif

#if GD32_PWM_USE_TIM22
  /* Driver initialization.*/
  pwmObjectInit(&PWMD22);
  PWMD22.channels = GD32_TIM22_CHANNELS;
  PWMD22.tim = GD32_TIM22;
#endif
}

/**
 * @brief   Configures and activates the PWM peripheral.
 * @note    Starting a driver that is already in the @p PWM_READY state
 *          disables all the active channels.
 *
 * @param[in] pwmp      pointer to a @p PWMDriver object
 *
 * @notapi
 */
void pwm_lld_start(PWMDriver *pwmp) {
  uint32_t psc;
  uint32_t ccer;

  if (pwmp->state == PWM_STOP) {
    /* Clock activation and timer reset.*/
#if GD32_PWM_USE_TIM1
    if (&PWMD1 == pwmp) {
      rccEnableTIM1(true);
      rccResetTIM1();
#if !defined(GD32_TIM1_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM1_UP_NUMBER, GD32_PWM_TIM1_IRQ_PRIORITY, GD32_PWM_TIM1_IRQ_TRIGGER);
      eclicEnableVector(GD32_TIM1_CC_NUMBER, GD32_PWM_TIM1_IRQ_PRIORITY, GD32_PWM_TIM1_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM1CLK)
      pwmp->clock = GD32_TIM1CLK;
#else
      pwmp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_PWM_USE_TIM2
    if (&PWMD2 == pwmp) {
      rccEnableTIM2(true);
      rccResetTIM2();
#if !defined(GD32_TIM2_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM2_NUMBER, GD32_PWM_TIM2_IRQ_PRIORITY, GD32_PWM_TIM2_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM2CLK)
      pwmp->clock = GD32_TIM2CLK;
#else
      pwmp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_PWM_USE_TIM3
    if (&PWMD3 == pwmp) {
      rccEnableTIM3(true);
      rccResetTIM3();
#if !defined(GD32_TIM3_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM3_NUMBER, GD32_PWM_TIM3_IRQ_PRIORITY, GD32_PWM_TIM3_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM3CLK)
      pwmp->clock = GD32_TIM3CLK;
#else
      pwmp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_PWM_USE_TIM4
    if (&PWMD4 == pwmp) {
      rccEnableTIM4(true);
      rccResetTIM4();
#if !defined(GD32_TIM4_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM4_NUMBER, GD32_PWM_TIM4_IRQ_PRIORITY, GD32_PWM_TIM4_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM4CLK)
      pwmp->clock = GD32_TIM4CLK;
#else
      pwmp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_PWM_USE_TIM5
    if (&PWMD5 == pwmp) {
      rccEnableTIM5(true);
      rccResetTIM5();
#if !defined(GD32_TIM5_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM5_NUMBER, GD32_PWM_TIM5_IRQ_PRIORITY, GD32_PWM_TIM5_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM5CLK)
      pwmp->clock = GD32_TIM5CLK;
#else
      pwmp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_PWM_USE_TIM8
    if (&PWMD8 == pwmp) {
      rccEnableTIM8(true);
      rccResetTIM8();
#if !defined(GD32_TIM8_SUPPRESS_ISR)
      eclicEnableVector(GD32_TIM8_UP_NUMBER, GD32_PWM_TIM8_IRQ_PRIORITY, GD32_PWM_TIM8_IRQ_TRIGGER);
      eclicEnableVector(GD32_TIM8_CC_NUMBER, GD32_PWM_TIM8_IRQ_PRIORITY, GD32_PWM_TIM8_IRQ_TRIGGER);
#endif
#if defined(GD32_TIM8CLK)
      pwmp->clock = GD32_TIM8CLK;
#else
      pwmp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_PWM_USE_TIM9
    if (&PWMD9 == pwmp) {
      rccEnableTIM9(true);
      rccResetTIM9();
#if defined(GD32_TIM9CLK)
      pwmp->clock = GD32_TIM9CLK;
#else
      pwmp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_PWM_USE_TIM10
    if (&PWMD10 == pwmp) {
      rccEnableTIM10(true);
      rccResetTIM10();
#if defined(GD32_TIM10CLK)
      pwmp->clock = GD32_TIM10CLK;
#else
      pwmp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_PWM_USE_TIM11
    if (&PWMD11 == pwmp) {
      rccEnableTIM11(true);
      rccResetTIM11();
#if defined(GD32_TIM11CLK)
      pwmp->clock = GD32_TIM11CLK;
#else
      pwmp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_PWM_USE_TIM12
    if (&PWMD12 == pwmp) {
      rccEnableTIM12(true);
      rccResetTIM12();
#if defined(GD32_TIM12CLK)
      pwmp->clock = GD32_TIM12CLK;
#else
      pwmp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_PWM_USE_TIM13
    if (&PWMD13 == pwmp) {
      rccEnableTIM13(true);
      rccResetTIM13();
#if defined(GD32_TIM13CLK)
      pwmp->clock = GD32_TIM13CLK;
#else
      pwmp->clock = GD32_TIMCLK1;
#endif
    }
#endif

