ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/TIM/hal_pwm_lld.c
#if GD32_PWM_USE_TIM14
    if (&PWMD14 == pwmp) {
      rccEnableTIM14(true);
      rccResetTIM14();
#if defined(GD32_TIM14CLK)
      pwmp->clock = GD32_TIM14CLK;
#else
      pwmp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_PWM_USE_TIM15
    if (&PWMD15 == pwmp) {
      rccEnableTIM15(true);
      rccResetTIM15();
#if defined(GD32_TIM15CLK)
      pwmp->clock = GD32_TIM15CLK;
#else
      pwmp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_PWM_USE_TIM16
    if (&PWMD16 == pwmp) {
      rccEnableTIM16(true);
      rccResetTIM16();
#if defined(GD32_TIM16CLK)
      pwmp->clock = GD32_TIM16CLK;
#else
      pwmp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_PWM_USE_TIM17
    if (&PWMD17 == pwmp) {
      rccEnableTIM17(true);
      rccResetTIM17();
#if defined(GD32_TIM17CLK)
      pwmp->clock = GD32_TIM17CLK;
#else
      pwmp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_PWM_USE_TIM20
    if (&PWMD20 == pwmp) {
      rccEnableTIM20(true);
      rccResetTIM20();
#if defined(GD32_TIM20CLK)
      pwmp->clock = GD32_TIM20CLK;
#else
      pwmp->clock = GD32_TIMCLK2;
#endif
    }
#endif

#if GD32_PWM_USE_TIM21
    if (&PWMD21 == pwmp) {
      rccEnableTIM21(true);
      rccResetTIM21();
#if defined(GD32_TIM21CLK)
      pwmp->clock = GD32_TIM21CLK;
#else
      pwmp->clock = GD32_TIMCLK1;
#endif
    }
#endif

#if GD32_PWM_USE_TIM22
    if (&PWMD22 == pwmp) {
      rccEnableTIM22(true);
      rccResetTIM22();
#if defined(GD32_TIM22CLK)
      pwmp->clock = GD32_TIM22CLK;
#else
      pwmp->clock = GD32_TIMCLK1;
#endif
    }
#endif

    /* All channels configured in PWM1 mode with preload enabled and will
       stay that way until the driver is stopped.*/
    pwmp->tim->CCMR1 = GD32_TIM_CCMR1_OC1M(6) | GD32_TIM_CCMR1_OC1PE |
                       GD32_TIM_CCMR1_OC2M(6) | GD32_TIM_CCMR1_OC2PE;
    pwmp->tim->CCMR2 = GD32_TIM_CCMR2_OC3M(6) | GD32_TIM_CCMR2_OC3PE |
                       GD32_TIM_CCMR2_OC4M(6) | GD32_TIM_CCMR2_OC4PE;
#if GD32_TIM_MAX_CHANNELS > 4
    pwmp->tim->CCMR3 = GD32_TIM_CCMR3_OC5M(6) | GD32_TIM_CCMR3_OC5PE |
                       GD32_TIM_CCMR3_OC6M(6) | GD32_TIM_CCMR3_OC6PE;
#endif
  }
  else {
    /* Driver re-configuration scenario, it must be stopped first.*/
    pwmp->tim->CR1    = 0;                  /* Timer disabled.              */
    pwmp->tim->CCR[0] = 0;                  /* Comparator 1 disabled.       */
    pwmp->tim->CCR[1] = 0;                  /* Comparator 2 disabled.       */
    pwmp->tim->CCR[2] = 0;                  /* Comparator 3 disabled.       */
    pwmp->tim->CCR[3] = 0;                  /* Comparator 4 disabled.       */
#if GD32_TIM_MAX_CHANNELS > 4
    if (pwmp->channels > 4) {
      pwmp->tim->CCXR[0] = 0;               /* Comparator 5 disabled.       */
      pwmp->tim->CCXR[1] = 0;               /* Comparator 6 disabled.       */
    }
#endif
    pwmp->tim->CNT  = 0;                    /* Counter reset to zero.       */
  }

  /* Timer configuration.*/
  psc = (pwmp->clock / pwmp->config->frequency) - 1;
  osalDbgAssert((psc <= 0xFFFF) &&
                ((psc + 1) * pwmp->config->frequency) == pwmp->clock,
                "invalid frequency");
  pwmp->tim->PSC  = psc;
  pwmp->tim->ARR  = pwmp->period - 1;
  pwmp->tim->CR2  = pwmp->config->cr2;

  /* Output enables and polarities setup.*/
  ccer = 0;
  switch (pwmp->config->channels[0].mode & PWM_OUTPUT_MASK) {
  case PWM_OUTPUT_ACTIVE_LOW:
    ccer |= GD32_TIM_CCER_CC1P;
    /* Falls through.*/
  case PWM_OUTPUT_ACTIVE_HIGH:
    ccer |= GD32_TIM_CCER_CC1E;
    /* Falls through.*/
  default:
    ;
  }
  switch (pwmp->config->channels[1].mode & PWM_OUTPUT_MASK) {
  case PWM_OUTPUT_ACTIVE_LOW:
    ccer |= GD32_TIM_CCER_CC2P;
    /* Falls through.*/
  case PWM_OUTPUT_ACTIVE_HIGH:
    ccer |= GD32_TIM_CCER_CC2E;
    /* Falls through.*/
  default:
    ;
  }
  switch (pwmp->config->channels[2].mode & PWM_OUTPUT_MASK) {
  case PWM_OUTPUT_ACTIVE_LOW:
    ccer |= GD32_TIM_CCER_CC3P;
    /* Falls through.*/
  case PWM_OUTPUT_ACTIVE_HIGH:
    ccer |= GD32_TIM_CCER_CC3E;
    /* Falls through.*/
  default:
    ;
  }
  switch (pwmp->config->channels[3].mode & PWM_OUTPUT_MASK) {
  case PWM_OUTPUT_ACTIVE_LOW:
    ccer |= GD32_TIM_CCER_CC4P;
    /* Falls through.*/
  case PWM_OUTPUT_ACTIVE_HIGH:
    ccer |= GD32_TIM_CCER_CC4E;
    /* Falls through.*/
  default:
    ;
  }
#if GD32_PWM_USE_ADVANCED
#if GD32_PWM_USE_TIM1 && !GD32_PWM_USE_TIM8 && !GD32_PWM_USE_TIM20
  if (&PWMD1 == pwmp) {
#endif
#if !GD32_PWM_USE_TIM1 && GD32_PWM_USE_TIM8 && !GD32_PWM_USE_TIM20
  if (&PWMD8 == pwmp) {
#endif
#if GD32_PWM_USE_TIM1 && GD32_PWM_USE_TIM8 && !GD32_PWM_USE_TIM20
  if ((&PWMD1 == pwmp) || (&PWMD8 == pwmp)) {
#endif
#if !GD32_PWM_USE_TIM1 && !GD32_PWM_USE_TIM8 && GD32_PWM_USE_TIM20
  if (&PWMD20 == pwmp) {
#endif
#if GD32_PWM_USE_TIM1 && !GD32_PWM_USE_TIM8 && GD32_PWM_USE_TIM20
  if ((&PWMD1 == pwmp) || (&PWMD20 == pwmp)) {
#endif
#if !GD32_PWM_USE_TIM1 && GD32_PWM_USE_TIM8 && GD32_PWM_USE_TIM20
  if ((&PWMD8 == pwmp) || (&PWMD20 == pwmp)) {
#endif
#if GD32_PWM_USE_TIM1 && GD32_PWM_USE_TIM8 && GD32_PWM_USE_TIM20
  if ((&PWMD1 == pwmp) || (&PWMD8 == pwmp) || (&PWMD20 == pwmp)) {
#endif
    switch (pwmp->config->channels[0].mode & PWM_COMPLEMENTARY_OUTPUT_MASK) {
    case PWM_COMPLEMENTARY_OUTPUT_ACTIVE_LOW:
      ccer |= GD32_TIM_CCER_CC1NP;
      /* Falls through.*/
    case PWM_COMPLEMENTARY_OUTPUT_ACTIVE_HIGH:
      ccer |= GD32_TIM_CCER_CC1NE;
      /* Falls through.*/
    default:
      ;
    }
    switch (pwmp->config->channels[1].mode & PWM_COMPLEMENTARY_OUTPUT_MASK) {
    case PWM_COMPLEMENTARY_OUTPUT_ACTIVE_LOW:
      ccer |= GD32_TIM_CCER_CC2NP;
      /* Falls through.*/
    case PWM_COMPLEMENTARY_OUTPUT_ACTIVE_HIGH:
      ccer |= GD32_TIM_CCER_CC2NE;
      /* Falls through.*/
    default:
      ;
    }
    switch (pwmp->config->channels[2].mode & PWM_COMPLEMENTARY_OUTPUT_MASK) {
    case PWM_COMPLEMENTARY_OUTPUT_ACTIVE_LOW:
      ccer |= GD32_TIM_CCER_CC3NP;
      /* Falls through.*/
    case PWM_COMPLEMENTARY_OUTPUT_ACTIVE_HIGH:
      ccer |= GD32_TIM_CCER_CC3NE;
      /* Falls through.*/
    default:
      ;
    }
    switch (pwmp->config->channels[3].mode & PWM_COMPLEMENTARY_OUTPUT_MASK) {
    case PWM_COMPLEMENTARY_OUTPUT_ACTIVE_LOW:
      ccer |= GD32_TIM_CCER_CC4NP;
      /* Falls through.*/
    case PWM_COMPLEMENTARY_OUTPUT_ACTIVE_HIGH:
      ccer |= GD32_TIM_CCER_CC4NE;
      /* Falls through.*/
    default:
      ;
    }
  }
#endif /* GD32_PWM_USE_ADVANCED*/

  pwmp->tim->CCER  = ccer;
  pwmp->tim->EGR   = GD32_TIM_EGR_UG;      /* Update event.                */
  pwmp->tim->SR    = 0;                     /* Clear pending IRQs.          */
  pwmp->tim->DIER  = pwmp->config->dier &   /* DMA-related DIER settings.   */
                     ~GD32_TIM_DIER_IRQ_MASK;
#if GD32_PWM_USE_TIM1 || GD32_PWM_USE_TIM8 || GD32_PWM_USE_TIM20
#if GD32_PWM_USE_ADVANCED
  pwmp->tim->BDTR  = pwmp->config->bdtr | GD32_TIM_BDTR_MOE;
#else
  pwmp->tim->BDTR  = GD32_TIM_BDTR_MOE;
#endif
#endif
  /* Timer configured and started.*/
  pwmp->tim->CR1   = GD32_TIM_CR1_ARPE | GD32_TIM_CR1_URS |
                     GD32_TIM_CR1_CEN;
}

/**
 * @brief   Deactivates the PWM peripheral.
 *
 * @param[in] pwmp      pointer to a @p PWMDriver object
 *
 * @notapi
 */
void pwm_lld_stop(PWMDriver *pwmp) {

